app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "1V7ABacE0OcZcpnTQ_Qvqg"], ["LIMIT", 1]]
---
  def generate_session_token
    st = SecureRandom.urlsafe_base64
    while User.find_by(session_token: st)